# MultistoryStandardStairTopEndExceedsOrNotReach Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..MultistoryStandardStairTopEndExceedsOrNotReach Property
BuiltInFailures..::..StairRampFailures Class See Also
---
One of the stairs inside multistory stairs top ends exceed or cannot reach the top elevation of the stair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MultistoryStandardStairTopEndExceedsOrNotReach { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MultistoryStandardStairTopEndExceedsOrNotReach As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MultistoryStandardStairTopEndExceedsOrNotReach {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace